In [3]:

import numpy  as np

import pandas as pd

student = pd.DataFrame({
    'Name': ['Tareq', 'Ali', 'Sara', 'Hassan', 'Ali', 'Hadi','alamin','sakil','sabbir'],
    'Age': [20, 21, 22, 23, 24, 25,26,27,28],
    'id': [1, 2, 3, 4, 5, 6,7,8,9],
    'GPA': [3.5, 3.6, 3.7, 3.8, 3.9, 4.0,4.1,4.2,4.3],
    'Department': ['CSE', 'EEE', 'BBA', 'CSE', 'EEE', 'BBA','CSE','EEE','BBA']})
print(student)

     Name  Age  id  GPA Department
0   Tareq   20   1  3.5        CSE
1     Ali   21   2  3.6        EEE
2    Sara   22   3  3.7        BBA
3  Hassan   23   4  3.8        CSE
4     Ali   24   5  3.9        EEE
5    Hadi   25   6  4.0        BBA
6  alamin   26   7  4.1        CSE
7   sakil   27   8  4.2        EEE
8  sabbir   28   9  4.3        BBA

In [4]:
student.duplicated()
# check for duplicate rows  
print(student.duplicated())

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
dtype: bool

In [5]:
student.set_index('Name', inplace=True)
# set the index to 'id' column  
print(student)

        Age  id  GPA Department
Name
Tareq    20   1  3.5        CSE
Ali      21   2  3.6        EEE
Sara     22   3  3.7        BBA
Hassan   23   4  3.8        CSE
Ali      24   5  3.9        EEE
Hadi     25   6  4.0        BBA
alamin   26   7  4.1        CSE
sakil    27   8  4.2        EEE
sabbir   28   9  4.3        BBA

In [6]:
student.applymap(lambda x: x*2 if isinstance(x, (int, float)) else x)

# apply a function to each element of the DataFrame
# print(student.applymap(lambda x: x*2 if isinstance(x, (int, float)) else x))

C:\Users\tareq\AppData\Local\Temp\ipykernel_14984\2118272903.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  student.applymap(lambda x: x*2 if isinstance(x, (int, float)) else x)

        Age  id  GPA Department
Name
Tareq    40   2  7.0        CSE
Ali      42   4  7.2        EEE
Sara     44   6  7.4        BBA
Hassan   46   8  7.6        CSE
Ali      48  10  7.8        EEE
Hadi     50  12  8.0        BBA
alamin   52  14  8.2        CSE
sakil    54  16  8.4        EEE
sabbir   56  18  8.6        BBA

In [7]:
date_time = np.datetime64('now')
print(date_time)

2025-04-26T18:19:33

In [25]:
df = pd.read_csv(r"C:\\Users\\tareq\\.jupyter\\data\\homelessness (1).csv")
print(df)

    Unnamed: 0              region                 state  individuals  \
0            0  East South Central               Alabama       2570.0
1            1             Pacific                Alaska       1434.0
2            2            Mountain               Arizona       7259.0
3            3  West South Central              Arkansas       2280.0
4            4             Pacific            California     109008.0
5            5            Mountain              Colorado       7607.0
6            6         New England           Connecticut       2280.0
7            7      South Atlantic              Delaware        708.0
8            8      South Atlantic  District of Columbia       3770.0
9            9      South Atlantic               Florida      21443.0
10          10      South Atlantic               Georgia       6943.0
11          11             Pacific                Hawaii       4131.0
12          12            Mountain                 Idaho       1297.0
13          13  East North Central              Illinois       6752.0
14          14  East North Central               Indiana       3776.0
15          15  West North Central                  Iowa       1711.0
16          16  West North Central                Kansas       1443.0
17          17  East South Central              Kentucky       2735.0
18          18  West South Central             Louisiana       2540.0
19          19         New England                 Maine       1450.0
20          20      South Atlantic              Maryland       4914.0
21          21         New England         Massachusetts       6811.0
22          22  East North Central              Michigan       5209.0
23          23  West North Central             Minnesota       3993.0
24          24  East South Central           Mississippi       1024.0
25          25  West North Central              Missouri       3776.0
26          26            Mountain               Montana        983.0
27          27  West North Central              Nebraska       1745.0
28          28            Mountain                Nevada       7058.0
29          29         New England         New Hampshire        835.0
30          30        Mid-Atlantic            New Jersey       6048.0
31          31            Mountain            New Mexico       1949.0
32          32        Mid-Atlantic              New York      39827.0
33          33      South Atlantic        North Carolina       6451.0
34          34  West North Central          North Dakota        467.0
35          35  East North Central                  Ohio       6929.0
36          36  West South Central              Oklahoma       2823.0
37          37             Pacific                Oregon      11139.0
38          38        Mid-Atlantic          Pennsylvania       8163.0
39          39         New England          Rhode Island        747.0
40          40      South Atlantic        South Carolina       3082.0
41          41  West North Central          South Dakota        836.0
42          42  East South Central             Tennessee       6139.0
43          43  West South Central                 Texas      19199.0
44          44            Mountain                  Utah       1904.0
45          45         New England               Vermont        780.0
46          46      South Atlantic              Virginia       3928.0
47          47             Pacific            Washington      16424.0
48          48      South Atlantic         West Virginia       1021.0
49          49  East North Central             Wisconsin       2740.0
50          50            Mountain               Wyoming        434.0

    family_members  state_pop
0            864.0    4887681
1            582.0     735139
2           2606.0    7158024
3            432.0    3009733
4          20964.0   39461588
5           3250.0    5691287
6           1696.0    3571520
7            374.0     965479
8           3134.0     701547
9           9587.0   21244317
10          2556.0   10511131
11          2399.0    1420593
12           715.0    1750536
13          3891.0   12723071
14          1482.0    6695497
15          1038.0    3148618
16           773.0    2911359
17           953.0    4461153
18           519.0    4659690
19          1066.0    1339057
20          2230.0    6035802
21         13257.0    6882635
22          3142.0    9984072
23          3250.0    5606249
24           328.0    2981020
25          2107.0    6121623
26           422.0    1060665
27           676.0    1925614
28           486.0    3027341
29           615.0    1353465
30          3350.0    8886025
31           602.0    2092741
32         52070.0   19530351
33          2817.0   10381615
34            75.0     758080
35          3320.0   11676341
36          1048.0    3940235
37          3337.0    4181886
38          5349.0   12800922
39           354.0    1058287
40           851.0    5084156
41           323.0     878698
42          1744.0    6771631
43          6111.0   28628666
44           972.0    3153550
45           511.0     624358
46          2047.0    8501286
47          5880.0    7523869
48           222.0    1804291
49          2167.0    5807406
50           205.0     577601

In [24]:
df.head()

,Unnamed: 0,region,state,individuals,family_members,state_pop
0,0,East South Central,Alabama,2570.0,864.0,4887681
1,1,Pacific,Alaska,1434.0,582.0,735139
2,2,Mountain,Arizona,7259.0,2606.0,7158024
3,3,West South Central,Arkansas,2280.0,432.0,3009733
4,4,Pacific,California,109008.0,20964.0,39461588

In [31]:
df.head(10)

,Unnamed: 0,region,state,individuals,family_members,state_pop
0,0,East South Central,Alabama,2570.0,864.0,4887681
1,1,Pacific,Alaska,1434.0,582.0,735139
2,2,Mountain,Arizona,7259.0,2606.0,7158024
3,3,West South Central,Arkansas,2280.0,432.0,3009733
4,4,Pacific,California,109008.0,20964.0,39461588
5,5,Mountain,Colorado,7607.0,3250.0,5691287
6,6,New England,Connecticut,2280.0,1696.0,3571520
7,7,South Atlantic,Delaware,708.0,374.0,965479
8,8,South Atlantic,District of Columbia,3770.0,3134.0,701547
9,9,South Atlantic,Florida,21443.0,9587.0,21244317